In [1]:
from sklearn.model_selection import train_test_split

In [2]:
from sklearn.linear_model import LogisticRegression

In [11]:
import pandas as pd

In [12]:
df1 = pd.read_csv("sent_emails.csv")

In [13]:
df2 = pd.read_csv("responded.csv")

In [14]:
df3 = pd.read_csv("userbase.csv")

In [15]:
df1

          Sent_Date  Customer_ID  SubjectLine_ID
0        2016-01-28         1413               2
1        2016-03-02        83889               2
2        2016-03-09       457832               3
3        2016-01-20       127772               1
4        2016-02-03       192123               3
...             ...          ...             ...
2476349  2016-02-22       460565               3
2476350  2016-02-25       360823               2
2476351  2016-03-02       443177               2
2476352  2016-03-12       179200               3
2476353  2016-01-17        68532               2

[2476354 rows x 3 columns]

In [16]:
df2

       Responded_Date  Customer_ID  SubjectLine_ID
0          2016-01-25       217102               3
1          2016-03-26       366875               2
2          2016-03-17       201561               2
3          2016-01-11       395345               3
4          2016-01-11       427539               3
...               ...          ...             ...
378203     2016-01-09        43156               1
378204     2016-03-16       397330               2
378205     2016-02-25       377520               1
378206     2016-02-04       146008               2
378207     2016-02-09       374971               3

[378208 rows x 3 columns]

In [17]:
df3

        Customer_ID Gender Type                   Email_Address  Age  Tenure
0                 1      M    C                     Mph@msn.com   38      12
1                 2      F    B     SophcYN7381qMe8lRqK@aol.com   37      23
2                 3      F    C                      xE@msn.com   32      15
3                 4      M    C             WduR0o0@comcast.net   31      24
4                 5      M    C        walHI9cmWJIBKvy0@aol.com   35      13
...             ...    ...  ...                             ...  ...     ...
499995       499996      M    B              iMt8ckJsdR@msn.com   25      12
499996       499997      F    C      z58KHLR7VtjRZYZh@gmail.com   30       9
499997       499998      M    B  PGqUn8eT9A4lz7geMZ@comcast.net   30      11
499998       499999      M    C              QkI8AH@hotmail.com   33      11
499999       500000      F    B                 7NYSY@yahoo.com   37      13

[500000 rows x 6 columns]

In [18]:
merged_df = df1.merge(df2, on='Customer_ID').merge(df3, on='Customer_ID')

In [21]:
merged_df['one_day_response']= merged_df.apply(lambda row: 1 if row['Sent_Date'] == row['Responded_Date'] else 0, axis=1)

In [22]:
merged_df["one_day_response"].value_counts()

one_day_response
0    2002147
1     243175
Name: count, dtype: int64

In [26]:
# I need a function that will take in a sent_date and received date and return 1 if the email was responded to on the same day, 0 otherwise
def one_day_response(row):
    if row['Sent_Date'] == row['Responded_Date']:
        return 1
    else:
        return 0

In [31]:
df['one_day_response'] = df.apply(one_day_response, axis=1)

In [3]:
from data_pipeline import ETL_Pipeline

In [4]:
etl = ETL_Pipeline()

In [5]:
etl.extract()

In [6]:
etl.data

,Sent_Date,Customer_ID,SubjectLine_ID,Responded_Date,Gender,Type,Email_Address,Age,Tenure
0,2016-01-28,1413,2,2016-01-31,M,B,Jaj2NuUJneD@gmail.com,44,12
1,2016-01-03,1413,2,2016-01-31,M,B,Jaj2NuUJneD@gmail.com,44,12
2,2016-02-03,192123,3,2016-02-04,M,C,Qtgy0C@msn.com,33,9
3,2016-03-22,192123,3,2016-02-04,M,C,Qtgy0C@msn.com,33,9
4,2016-02-07,399506,2,2016-03-24,M,C,JQVjAP2eVCnIz@hotmail.com,26,21
...,...,...,...,...,...,...,...,...,...
996447,2016-02-24,199997,3,2016-02-24,F,C,FTS1fGSti8VbILJQibW@yahoo.com,23,26
996448,2016-02-26,450147,3,2016-02-28,M,B,oO9hwPY@yahoo.com,52,16
996449,2016-03-19,290272,3,2016-03-20,M,C,d@yahoo.com,23,12
996450,2016-02-28,287907,3,2016-03-03,M,C,DY@hotmail.com,20,22
996451,2016-01-21,78807,2,2016-01-21,M,B,RmGYvyN3FN02izZ@yahoo.com,40,25

In [7]:
etl.transform()

In [8]:
etl.load()

In [9]:
import pandas as pd

In [10]:
df = pd.read_csv("transformed_data.csv", index_col=0, low_memory=False)

In [11]:
df

,SubjectLine_ID,Gender,Type,Email_Address,Age,Tenure,one_day_response
0,2,M,B,Jaj2NuUJneD@gmail.com,44,12,0
1,2,M,B,Jaj2NuUJneD@gmail.com,44,12,0
2,3,M,C,Qtgy0C@msn.com,33,9,0
3,3,M,C,Qtgy0C@msn.com,33,9,0
4,2,M,C,JQVjAP2eVCnIz@hotmail.com,26,21,0
...,...,...,...,...,...,...,...
996447,3,F,C,FTS1fGSti8VbILJQibW@yahoo.com,23,26,1
996448,3,M,B,oO9hwPY@yahoo.com,52,16,0
996449,3,M,C,d@yahoo.com,23,12,0
996450,3,M,C,DY@hotmail.com,20,22,0
996451,2,M,B,RmGYvyN3FN02izZ@yahoo.com,40,25,1

In [12]:
df["one_day_response"].value_counts()

one_day_response
0    767342
1    229110
Name: count, dtype: int64